# IsSplitVertically Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..IsSplitVertically Property
ViewCropRegionShapeManager Class See Also
---
Whether or not the view's crop is split (and the split is vertical).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsSplitVertically { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSplitVertically As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSplitVertically {
	bool get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace